// Задача 15: Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

Console.WriteLine("Введите цифру дня недели - от 1 до 7: ");
int number = Convert.ToInt32(Console.ReadLine());

if (number = 1) 
{
    Console.WriteLine("Рабочий день");
}
if (number = 2)
{
    Console.WriteLine("Рабочий день");
}
if (number = 3)
{
    Console.WriteLine("Рабочий день");
}
if (number = 4)
{
    Console.WriteLine("Рабочий день");
}
if (number = 5)
{
    Console.WriteLine("Рабочий день");
}
if (number = 6)
{
    Console.WriteLine("Неабочий день");
}
if (number = 7)
{
    Console.WriteLine("Неабочий день");
}
